ХамелионЦРПТ/src/Documents/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</name>
  <basedOn>Document.ВводВОборот_ХамелеонЦРПТ</basedOn>
  <basedOn>Document.ЗаказМарок_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКороба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаУпаковок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКМ</name>
    <type>
      <types>EnumRef.СтатусыКМДляАгрегации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдПроизводственногоЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУпаковки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GTINУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказДляФормированияНомераКОроба</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводВоборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасформированиеКоробов</name>
    <type>
      <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПалет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЛекарства</name>
    <type>
      <types>CatalogRef.Договора_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВГрупповую</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыйКороб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятьИзУпаковки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАгрегации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.Тип_КМ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БылоДоЭтого</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылканаДокумент</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркиОприходовать</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераБлоков</name>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Агрегации</name>
    <attributes>
      <name>Агрегация</name>
      <type>
        <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/Documents/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ/Forms/ФормаВыбораКМ/Module.bsl
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Вставить содержимое обработчика.
	Если ТекущаяСтраница=Элементы.ВыборПартии Тогда
		Если Элементы.Продукция.ТекущиеДанные<>Неопределено Тогда
			МассивУдалимначалаВсе=Новый Массив;
			Для Каждого стр_1 Из список.Отбор.Элементы Цикл
				МассивУдалимначалаВсе.Добавить(Стр_1);
			Конеццикла;
			Для Каждого Стр Из МассивУдалимначалаВсе Цикл
				
				Список.Отбор.Элементы.Удалить(Стр);
			Конеццикла;
			
			Стр=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
			Стр.Использование=Истина;
			Стр.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Продукция");
			Стр.ПравоеЗначение=Элементы.Продукция.ТекущиеДанные.Ссылка; 
			Стр.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			
		КонецЕслИ;
		
		
	КонецЕслИ;
КонецПроцедуры


&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	Элементы.Страницы.ТекущаяСтраница=Элементы.ВыборПартии;
	СтраницыПриСменеСтраницы(Элемент, Элементы.ВыборПартии)	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Организация="";
	Параметры.Свойство("Организация",Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	Продукция.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	
	Марки="";
	Параметры.Свойство("Марки",Марки);
	
	Список.Параметры.УстановитьЗначениеПараметра("СерНОМ",Марки);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПартии(Команда)
	// Вставить содержимое обработчика.
	Масс=Новый Массив;
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки  Цикл
		Масс.Добавить(Стр);
		//Элементы.Список.ТекущаяСтрока=Стр;
	Конеццикла;
	
	Масс_1=Новый Массив;
	Для Каждого Стр Из Масс  Цикл
		Элементы.Список.ТекущаяСтрока=Стр;
		Масс_1.Добавить(Элементы.Список.ТекущиеДанные.СерийныйНомер)
	Конеццикла;
	ЭтаФорма.Закрыть(Масс_1);
	
	//ЭтаФорма.Закрыть(ВернутьМассивУжеЦИСОВ());
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Масс=Новый Массив;
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки  Цикл
		Масс.Добавить(Стр);
		//Элементы.Список.ТекущаяСтрока=Стр;
	Конеццикла;
	
	Масс_1=Новый Массив;
	Для Каждого Стр Из Масс  Цикл
		Элементы.Список.ТекущаяСтрока=Стр;
		Масс_1.Добавить(Элементы.Список.ТекущиеДанные.СерийныйНомер)
	Конеццикла;
	ЭтаФорма.Закрыть(Масс_1);
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ОбновитьОСтаток();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОстаток()
	МассивУдалимначалаВсе=Новый Массив;
	Для Каждого стр_1 Из Продукция.Отбор.Элементы Цикл
		Если Стр_1.Представление="ОТБОРОСТАТКИ" Тогда
			МассивУдалимначалаВсе.Добавить(Стр_1);
		КонецЕсли;
	Конеццикла;
	Для Каждого Стр Из МассивУдалимначалаВсе Цикл
		
		Продукция.Отбор.Элементы.Удалить(Стр);
	Конеццикла;
	Если Не ПоказатьВсе Тогда
		
		Стр=Продукция.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
		Стр.Использование=Истина;
		Стр.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("КоличествоОстаток");
		Стр.ПравоеЗначение=0; 
		Стр.Представление="ОТБОРОСТАТКИ";
		Стр.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьОстаток();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьОрганзиацияю();
КонецПроцедуры


Процедура ОбновитьОрганзиацияю()
	Список.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	Продукция.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИнфморацию(Команда)
	// Вставить содержимое обработчика.
	Обр=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если Обр.Организации.Количество()=0 Тогда
		Обр.ПодключитьсяКЦРПТ(Команда,Ложь);
	КонецЕсли;
	Если Обр.Организации.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
			
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
	ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПолучитьИнформациюПоКМ(ДеревоКМ,Элементы.Список.ТекущиеДанные.СерийныйНомер,Обр.Пользователь);
	Элементы.Страницы.ТекущаяСтраница=Элементы.ИнформацияОКМ;
	КонецЕсли;
КонецПроцедуры
